In [3]:
import numpy as np
import pandas as pd

# Pandas series Data Structure

In [5]:
s=pd.Series([1,2,3,4])
print(s)

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
print(s[2])

3

In [7]:
print(s[1:3])

1    2
2    3
dtype: int64

In [8]:
s=pd.Series(['x','y','z','xyz'])
print(s)

0      x
1      y
2      z
3    xyz
dtype: object

In [9]:
s=pd.Series(['meenakshi','vutla'])
print(s)

0    meenakshi
1        vutla
dtype: object

# Creating Series  from numpy ndarray

In [11]:
data=np.array([10,20,30,40,50])
s=pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [13]:
s=pd.Series([1,2,3,4,5])
print(s[2])
print("*"*20)
print(s[1:])
print("*"*20)
print(s[[1,4]])  #Accessing multiple elements from the row

3
********************
1    2
2    3
3    4
4    5
dtype: int64
********************
1    2
4    5
dtype: int64

In [24]:


s = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])

print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [20]:
print(s['a'])

1

In [21]:
print(s['a':])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [22]:
# Retrieve multiple elements

print(s[['a', 'b', 'e']])

a    1
b    2
e    5
dtype: int64

# Pandas Data Frame

# Creating Data Frame using Dictionary

In [28]:
data={'name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,36]}
df=pd.DataFrame(data)
df

    name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   36

In [29]:
# Creating indexed dataframe

data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'], 
        'Age':[28,34,29,42],
       'Gender':['Male', 'Female', 'Female', 'Male']}
df = pd.DataFrame(data, index=['I-1', 'I-2', 'I-3', 'I-4'])
df

      Name  Age  Gender
I-1    Tom   28    Male
I-2   Jack   34  Female
I-3  Steve   29  Female
I-4  Ricky   42    Male

In [32]:
df = pd.DataFrame({
    'col-1': ['Item-1', 'Item-2', 'Item-3', 'Item-4'],
    'col-2': ['Gold', 'Bronze', 'Gold', 'Silver'],
    'col-3': [1, 2, np.nan, 4]})   # not a null value
df

    col-1   col-2  col-3
0  Item-1    Gold    1.0
1  Item-2  Bronze    2.0
2  Item-3    Gold    NaN
3  Item-4  Silver    4.0